#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:004351562122:certificate/1d81da9d-0a13-4ccd-a520-afe401cab5c6]
data.aws_caller_identity.current: Reading...
data.aws_route53_zone.selected: Reading...
aws_cloudfront_function.append_index: Refreshing state... [id=append-index]
module.cloudfront.aws_cloudfront_origin_access_control.this["s3_oac"]: Refreshing state... [id=E3R7ITY1ZA9AK3]
data.aws_caller_identity.current: Read complete after 0s [id=004351562122]
aws_s3_bucket.logs: Refreshing state... [id=aheadinthecloud-logs-us-east-1-004351562122-prod]
aws_s3_bucket.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_s3_bucket_ownership_controls.logs: Refreshing state... [id=aheadinthecloud-logs-us-east-1-004351562122-prod]
aws_s3_bucket_logging.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_s3_bucket_policy.logs: Refreshing state... [id=aheadinthecloud-logs-us-east-1-004351562122-prod]
data.aws_route53_zone.selected: Read complete after 1s [id=Z03189763RZCA5U9KR8I7]
aws_route53_record.acm["aheadinthecloud.com"]: Refreshing state... [id=Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME]
aws_route53_record.acm["*.aheadinthecloud.com"]: Refreshing state... [id=Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME]
aws_acm_certificate_validation.this: Refreshing state... [id=2023-07-12 20:53:34.058 +0000 UTC]
module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E3AB5V8CH4QET7]
module.cloudfront.aws_cloudfront_monitoring_subscription.this[0]: Refreshing state... [id=E3AB5V8CH4QET7]
aws_s3_bucket_policy.domain: Refreshing state... [id=aheadinthecloud-us-east-1-004351562122-prod]
aws_route53_record.domain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_aheadinthecloud.com_A]
aws_route53_record.subdomain: Refreshing state... [id=Z08846413OJRCH3MJOFHV_www.aheadinthecloud.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.logs will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "004351562122",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "logging.s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # data.aws_iam_policy_document.oac will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "oac" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::004351562122:distribution/E3AB5V8CH4QET7",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_acm_certificate.this must be replaced
+/- resource "aws_acm_certificate" "this" {
      ~ arn                       = "arn:aws:acm:us-east-1:004351562122:certificate/1d81da9d-0a13-4ccd-a520-afe401cab5c6" -> (known after apply)
      ~ domain_name               = "aheadinthecloud.com" -> "serverlessbio.com" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "*.aheadinthecloud.com"
              - resource_record_name  = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6f9e120e77ada084af4c5a19c6ac73c4.vrcmzfbvtx.acm-validations.aws."
            },
          - {
              - domain_name           = "aheadinthecloud.com"
              - resource_record_name  = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6f9e120e77ada084af4c5a19c6ac73c4.vrcmzfbvtx.acm-validations.aws."
            },
          + {
              + domain_name           = "*.serverlessbio.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "serverlessbio.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:us-east-1:004351562122:certificate/1d81da9d-0a13-4ccd-a520-afe401cab5c6" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2024-08-09T23:59:59Z" -> (known after apply)
      ~ not_before                = "2023-07-12T00:00:00Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      ~ renewal_eligibility       = "ELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "*.aheadinthecloud.com",
          - "aheadinthecloud.com",
          + "*.serverlessbio.com",
          + "serverlessbio.com",
        ]
      - tags                      = {} -> null
      ~ tags_all                  = {} -> (known after apply)
      ~ type                      = "AMAZON_ISSUED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
        # (1 unchanged attribute hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.this must be replaced
-/+ resource "aws_acm_certificate_validation" "this" {
      ~ certificate_arn         = "arn:aws:acm:us-east-1:004351562122:certificate/1d81da9d-0a13-4ccd-a520-afe401cab5c6" # forces replacement -> (known after apply) # forces replacement
      ~ id                      = "2023-07-12 20:53:34.058 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [ # forces replacement
          - "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com",
        ] -> (known after apply) # forces replacement
    }

  # aws_route53_record.acm["*.aheadinthecloud.com"] will be destroyed
  # (because key ["*.aheadinthecloud.com"] is not in for_each map)
  - resource "aws_route53_record" "acm" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com" -> null
      - id                               = "Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com" -> null
      - records                          = [
          - "_6f9e120e77ada084af4c5a19c6ac73c4.vrcmzfbvtx.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z08846413OJRCH3MJOFHV" -> null
    }

  # aws_route53_record.acm["*.serverlessbio.com"] will be created
  + resource "aws_route53_record" "acm" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z03189763RZCA5U9KR8I7"
    }

  # aws_route53_record.acm["aheadinthecloud.com"] will be destroyed
  # (because key ["aheadinthecloud.com"] is not in for_each map)
  - resource "aws_route53_record" "acm" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com" -> null
      - id                               = "Z08846413OJRCH3MJOFHV__34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_34cbee92d8ff22eadfb1921346869f3b.aheadinthecloud.com" -> null
      - records                          = [
          - "_6f9e120e77ada084af4c5a19c6ac73c4.vrcmzfbvtx.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z08846413OJRCH3MJOFHV" -> null
    }

  # aws_route53_record.acm["serverlessbio.com"] will be created
  + resource "aws_route53_record" "acm" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z03189763RZCA5U9KR8I7"
    }

  # aws_route53_record.domain must be replaced
-/+ resource "aws_route53_record" "domain" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "aheadinthecloud.com" -> (known after apply)
      ~ id                               = "Z08846413OJRCH3MJOFHV_aheadinthecloud.com_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "aheadinthecloud.com" -> "serverlessbio.com" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z08846413OJRCH3MJOFHV" -> "Z03189763RZCA5U9KR8I7" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.subdomain must be replaced
-/+ resource "aws_route53_record" "subdomain" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "www.aheadinthecloud.com" -> (known after apply)
      ~ id                               = "Z08846413OJRCH3MJOFHV_www.aheadinthecloud.com_A" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "www.aheadinthecloud.com" -> "www.serverlessbio.com" # forces replacement
      - records                          = [] -> null
      - ttl                              = 0 -> null
      ~ zone_id                          = "Z08846413OJRCH3MJOFHV" -> "Z03189763RZCA5U9KR8I7" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.domain must be replaced
-/+ resource "aws_s3_bucket" "domain" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::aheadinthecloud-us-east-1-004351562122-prod" -> (known after apply)
      ~ bucket                      = "aheadinthecloud-us-east-1-004351562122-prod" -> "serverlessbio-us-east-1-004351562122-prod" # forces replacement
      ~ bucket_domain_name          = "aheadinthecloud-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "aheadinthecloud-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "aheadinthecloud-us-east-1-004351562122-prod" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::004351562122:distribution/E3AB5V8CH4QET7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::aheadinthecloud-us-east-1-004351562122-prod/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      ~ website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint            = "aheadinthecloud-us-east-1-004351562122-prod.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "236eaafd9286a41f6d33fa8f096290921d529a32d07c40c63ba26df2ec2779cc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - logging {
          - target_bucket = "aheadinthecloud-logs-us-east-1-004351562122-prod" -> null
          - target_prefix = "s3/" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket.logs must be replaced
-/+ resource "aws_s3_bucket" "logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::aheadinthecloud-logs-us-east-1-004351562122-prod" -> (known after apply)
      ~ bucket                      = "aheadinthecloud-logs-us-east-1-004351562122-prod" -> "serverlessbio-logs-us-east-1-004351562122-prod" # forces replacement
      ~ bucket_domain_name          = "aheadinthecloud-logs-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "aheadinthecloud-logs-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "aheadinthecloud-logs-us-east-1-004351562122-prod" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      ~ policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - ArnLike      = {
                              - "aws:SourceArn" = "arn:aws:s3:::aheadinthecloud-us-east-1-004351562122-prod"
                            }
                          - StringEquals = {
                              - "aws:SourceAccount" = "004351562122"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "logging.s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::aheadinthecloud-logs-us-east-1-004351562122-prod/s3/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (1 unchanged attribute hidden)

      - grant {
          - id          = "236eaafd9286a41f6d33fa8f096290921d529a32d07c40c63ba26df2ec2779cc" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      - grant {
          - id          = "c4c1ede66af53448b93c283ce9448c4ba468c9432aa01d700d3878632f77d2d0" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_logging.domain must be replaced
-/+ resource "aws_s3_bucket_logging" "domain" {
      ~ bucket        = "aheadinthecloud-us-east-1-004351562122-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id            = "aheadinthecloud-us-east-1-004351562122-prod" -> (known after apply)
      ~ target_bucket = "aheadinthecloud-logs-us-east-1-004351562122-prod" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_ownership_controls.logs must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "logs" {
      ~ bucket = "aheadinthecloud-logs-us-east-1-004351562122-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "aheadinthecloud-logs-us-east-1-004351562122-prod" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_policy.domain must be replaced
-/+ resource "aws_s3_bucket_policy" "domain" {
      ~ bucket = "aheadinthecloud-us-east-1-004351562122-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "aheadinthecloud-us-east-1-004351562122-prod" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "aws:SourceArn" = "arn:aws:cloudfront::004351562122:distribution/E3AB5V8CH4QET7"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::aheadinthecloud-us-east-1-004351562122-prod/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # aws_s3_bucket_policy.logs must be replaced
-/+ resource "aws_s3_bucket_policy" "logs" {
      ~ bucket = "aheadinthecloud-logs-us-east-1-004351562122-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "aheadinthecloud-logs-us-east-1-004351562122-prod" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - ArnLike      = {
                              - "aws:SourceArn" = "arn:aws:s3:::aheadinthecloud-us-east-1-004351562122-prod"
                            }
                          - StringEquals = {
                              - "aws:SourceAccount" = "004351562122"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "logging.s3.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::aheadinthecloud-logs-us-east-1-004351562122-prod/s3/*"
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.cloudfront.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
      ~ aliases                        = [
          - "aheadinthecloud.com",
          - "www.aheadinthecloud.com",
          + "serverlessbio.com",
          + "www.serverlessbio.com",
        ]
        id                             = "E3AB5V8CH4QET7"
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ logging_config {
          ~ bucket          = "aheadinthecloud-logs-us-east-1-004351562122-prod.s3.amazonaws.com" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "aheadinthecloud-us-east-1-004351562122-prod.s3.amazonaws.com" -> null
          - origin_access_control_id = "E3R7ITY1ZA9AK3" -> null
          - origin_id                = "s3" -> null
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = "E3R7ITY1ZA9AK3"
          + origin_id                = "s3"
        }

      ~ viewer_certificate {
          ~ acm_certificate_arn            = "arn:aws:acm:us-east-1:004351562122:certificate/1d81da9d-0a13-4ccd-a520-afe401cab5c6" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (4 unchanged blocks hidden)
    }

Plan: 12 to add, 1 to change, 12 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mmccarthy404, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-ci`*